Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/atdf/PIC32MZ2048EFH144.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!--
 Copyright (c) 2017 Microchip Technology Inc.
 SPDX-License-Identifier: Apache-2.0
 Licensed under the Apache License, Version 2.0 (the "License");
 you may not use this file except in compliance with the License.
 You may obtain a copy of the License at
 http://www.apache.org/licenses/LICENSE-2.0
 Unless required by applicable law or agreed to in writing, software
 distributed under the License is distributed on an "AS IS" BASIS,
 WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 See the License for the specific language governing permissions and
 limitations under the License.
-->
<avr-tools-device-file schema-version="0.6" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd" xmlns:mhc="http://www.atmel.com/schemas/avr-tools-device-file/mhc">
<file timestamp="2019-08-28T10:30:33Z"/>
<variants>
   <variant package="LQFP144" pinout="LQFP144_TQFP144_TFBGA144" speedmax="252000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="2.1"/>
   <variant package="TQFP144" pinout="LQFP144_TQFP144_TFBGA144" speedmax="252000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="2.1"/>
   <variant package="TFBGA144" pinout="LQFP144_TQFP144_TFBGA144" speedmax="252000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="2.1"/>
</variants>
<devices>
   <device architecture="MIPS" family="PIC32MZEF" name="PIC32MZ2048EFH144" series="PIC32MZ">
      <address-spaces>
         <address-space endianness="little" id="base" name="base" size="0x100000000" start="0">
            <memory-segment exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type=""/>
            <memory-segment exec="" name="devid" rw="" size="0x0" start="0xffffffff" type=""/>
            <memory-segment exec="" name="code" rw="" size="0x200000" start="0x1d000000" type=""/>
            <memory-segment exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type=""/>
            <memory-segment exec="" name="boot1" rw="" size="0xff00" start="0x1fc40000" type=""/>
            <memory-segment exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type=""/>
            <memory-segment exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type=""/>
            <memory-segment exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type=""/>
            <memory-segment exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type=""/>
            <memory-segment exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type=""/>
            <memory-segment exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type=""/>
            <memory-segment exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type=""/>
            <memory-segment exec="" name="lowerbootaliasaltconfig" rw="" size="0x40" start="0x1fc0ff40" type=""/>
            <memory-segment exec="" name="upperbootaliasaltconfig" rw="" size="0x40" start="0x1fc2ff40" type=""/>
            <memory-segment exec="" name="upperbootaliasconfig" rw="" size="0x40" start="0x1fc2ffc0" type=""/>
            <memory-segment exec="" name="altboot1config" rw="" size="0x40" start="0x1fc4ff40" type=""/>
            <memory-segment exec="" name="boot1config" rw="" size="0x40" start="0x1fc4ffc0" type=""/>
            <memory-segment exec="" name="altboot2config" rw="" size="0x40" start="0x1fc6ff40" type=""/>
            <memory-segment exec="" name="boot2config" rw="" size="0x40" start="0x1fc6ffc0" type=""/>
            <memory-segment exec="" name="kseg0_data_mem" rw="" size="0x80000" start="0x0" type=""/>
            <memory-segment exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type=""/>
            <memory-segment exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type=""/>
            <memory-segment exec="" name="periph_pb1_std" rw="" size="0x1800" start="0x1f800000" type=""/>
            <memory-segment exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type=""/>
            <memory-segment exec="" name="periph_pb2_std" rw="" size="0xe200" start="0x1f820000" type=""/>
            <memory-segment exec="" name="periph_pb3_std" rw="" size="0xc200" start="0x1f840000" type=""/>
            <memory-segment exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type=""/>
            <memory-segment exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type=""/>
            <memory-segment exec="" name="periph_indep" rw="" size="0x7000" start="0x1f8e0000" type=""/>
            <memory-segment exec="" name="periph_ssx" rw="" size="0x10000" start="0x1f8f0000" type=""/>
         </address-space>
         <address-space endianness="" id="lowerbootaliasconfig" name="lowerbootaliasconfig" size="0x40" start="0x1fc0ffc0"/>
         <address-space endianness="" id="serial" name="serial" size="0x28" start="0x1FC54000"/>
      </address-spaces>
      <property-groups>
         <property-group name="SIGNATURES">
            <property name="JTAGID" value=""/>
            <property name="DEVID_DEVID" value="0x7227053"/>
         </property-group>
         <property-group name="LEGACY_INSTANCE_IDS"/>
      </property-groups>
      <parameters>
         <param caption="MPU present or not" name="__MPU_PRESENT" value="1"/>
         <param caption="Number of interrupt priority levels" name="__INT_PRIO_LEVELS" value="7"/>
         <param caption="Number of interrupt subpriority levels" name="__INT_SUBPRIO_LEVELS" value="4"/>
         <param caption="Number of interrupt shadow register sets" name="__INT_NUM_SHADOW_SETS" value="7"/>
         <param caption="Vector Table Offset Register present or not" name="__VTOR_PRESENT" value="1"/>
         <param caption="FPU present or not" name="__FPU_PRESENT" value="1"/>
         <param caption="Double Precision FPU implemented or not" name="__FPU_DP" value="1"/>
         <param caption="Instruction Cache present or not" name="__ICACHE_PRESENT" value="1"/>
         <param caption="Data Cache present or not" name="__DCACHE_PRESENT" value="1"/>
         <param caption="Instruction TCM present or not" name="__ITCM_PRESENT" value="0"/>
         <param caption="Data TCM present or not" name="__DTCM_PRESENT" value="0"/>
         <param caption="Little endian used or not" name="LITTLE_ENDIAN" value="1"/>
         <param caption="ARM architecture or not" name="__ARCH_ARM" value="0"/>
         <param caption="Number of oscillators present" name="__NUM_OSC" value="8"/>
         <param caption="System Clock Default Frequency" name="__SYS_DEF_FREQ" value="200000000"/>
         <param caption="Peripheral Bus 1 Default Clock Frequency" name="__PB1_DEF_FREQ" value="100000000"/>
         <param caption="Peripheral Bus 2 Default Clock Frequency" name="__PB2_DEF_FREQ" value="100000000"/>
         <param caption="Peripheral Bus 3 Default Clock Frequency" name="__PB3_DEF_FREQ" value="100000000"/>
         <param caption="Peripheral Bus 4 Default Clock Frequency" name="__PB4_DEF_FREQ" value="200000000"/>
         <param caption="Peripheral Bus 5 Default Clock Frequency" name="__PB5_DEF_FREQ" value="120000000"/>
         <param caption="Peripheral Bus 6 Default Clock Frequency" name="__PB6_DEF_FREQ" value="100000000"/>
         <param caption="Peripheral Bus 7 Default Clock Frequency" name="__PB7_DEF_FREQ" value="200000000"/>
         <param caption="Peripheral Bus 8 Default Clock Frequency" name="__PB8_DEF_FREQ" value="100000000"/>
         <param caption="Reference Clock 1 Default Frequency" name="__REFCLK1_DEF_FREQ" value="200000000"/>
         <param caption="Reference Clock 2 Default Frequency" name="__REFCLK2_DEF_FREQ" value="200000000"/>
         <param caption="Reference Clock 3 Default Frequency" name="__REFCLK3_DEF_FREQ" value="200000000"/>
         <param caption="Reference Clock 4 Default Frequency" name="__REFCLK4_DEF_FREQ" value="200000000"/>
         <param caption="Primary Oscillator Input Default Frequency" name="__POSC_DEF_FREQ" value="24000000"/>
         <param caption="Secondary Oscillator Input Default Frequency" name="__SOSC_DEF_FREQ" value="32768"/>
         <param caption="Peripheral Bus 1 Default Divider Value" name="__PB1_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 2 Default Divider Value" name="__PB2_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 3 Default Divider Value" name="__PB3_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 4 Default Divider Value" name="__PB4_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 5 Default Divider Value" name="__PB5_DEF_DIV" value="2"/>
         <param caption="Peripheral Bus 7 Default Divider Value" name="__PB7_DEF_DIV" value="1"/>
         <param caption="Peripheral Bus 8 Default Divider Value" name="__PB8_DEF_DIV" value="2"/>
         <param caption="Number of DMA Channels" name="__NUM_DMA_CHANNELS" value="8"/>
      </parameters>
      <peripherals>
         <module id="02508" name="ADCHS" version="">
            <instance name="ADCHS">
               <register-group address-space="periph_pb3_std" name="ADCHS" name-in-module="ADCHS" offset="0x1f84b000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
         </module>
         <module id="01152" name="CAN" version="">
            <instance name="CAN1">
               <register-group address-space="periph_pb5_std" name="CAN" name-in-module="CAN" offset="0x1f880000"/>
               <parameters>
                  <param name=""/>
               </parameters>
            </instance>
            <instance name="CAN2"/>
         </module>
